# Створіть 6 змінних з будь-якими значенням


# Робота з числами
# Умова:
#
# Створіть дві змінні, a та b, та присвойте їм будь-які числові значення (цілі або дробові).
# Обчисліть їх суму, різницю і тд.
# Виведіть результати кожної операції на екран з відповідними поясненнями

# Робота з рядками (Strings)
# Умова:
#
# Створіть змінну first_name та присвойте їй ваше ім’я.
# Створіть змінну last_name та присвойте їй ваше прізвище.
# Створіть змінну full_name, об’єднавши (конкатенувавши) ім’я та прізвище через пробіл.
# Виведіть full_name на екран.



# Змішані типи та введення даних
# Умова:
# ім’я збережіть у змінну.
# вік збережіть у змінну.
# Обчисліть, скільки років буде користувачу через 10 років.
# Виведіть повідомлення у форматі: “Привіт, [Ім’я]! Тобі зараз [Вік] років. Через 10 років тобі буде [Вік+10] років.”