# Створіть словник з назвою fruit_stock.
# Додайте до нього три пари “ключ: значення”:
# “apple”: 10
# “banana”: 15
# “orange”: 8
# Виведіть на екран весь словник fruit_stock.
# Виведіть на екран кількість яблук, звернувшись до значення за ключем “apple”.
# Додайте новий фрукт до словника: “груша” зі значенням 12.
# Змініть кількість banana: встановіть нове значення 20.
# Виведіть на екран оновлений словник fruit_stock.
#
# fruit_stock = {
#     "apple":10,
#     "banana":15,
#     "orange":8
# }
# print(fruit_stock)
# print(fruit_stock["apple"])
#
# fruit_stock['pear']=12
# print(fruit_stock)
# fruit_stock["banana"]=20
# print(fruit_stock)

# Створення та доступ до елементів списку
# Створіть список з назвою shopping_list, який містить наступні рядки: "молоко", "хліб", "яйця", "сир".
# Виведіть на екран весь список.
# Виведіть на екран перший елемент списку (той, що має індекс 0)
# shoping_list = ["молоко","хліб","яйця","сир"]
# print(shoping_list)
# print(shoping_list[0])



# Створи список із 7 собак.
# Кожна собака — словник з трьома полями: "name" (кличка), "age" (вік), "breed" (порода).
# Виведи третю собаку зі списку та її клич

dogs = [
    {   "name": "boy",
        "age": 2,
        "breed": "alabay"
     },
    {
        "name": "ksu",
        "age": 4,
        "breed": "haski"
    },
    {
        "name": "john",
        "age": 5,
        "breed": "chennai"
    },
    {
        "name": "ali",
        "age": 6,
        "breed": "creed"
    }

]

print(dogs)

print(dogs[2]["breed"])

# Створи 10 кортежів з довільною інформацією (наприклад, ім’я, вік, місто).
# Наповнити спиок цими кортежами
tup_1 =("Роман",33,"Зоря")
tup_2 =("Роман",33,"Зоря")
tup_3 =("Роман",33,"Зоря")
tup_4 =("Роман",33,"Зоря")
tup_5 =("Роман",33,"Зоря")
tup_6 =("Роман",33,"Зоря")
tup_7 =("Роман",33,"Зоря")
tup_8 =("Роман",33,"Зоря")
tup_9 =("Роман",33,"Зоря")
tup_0 =("Роман",33,"Зоря")

list_tup=[
    tup_1,
    tup_2,
    tup_3,
    tup_4,
    tup_5,
    tup_6,
    tup_7,
    tup_8,
    tup_9,
    tup_0
]
print(list_tup)

# Створи 5 окремих масивів (списків) у Python.
# Об’єднай їх в один список за допомогою оператора * (розпакування списків).

list_num_1=[1,2,3,4,5]
list_num_2=[1,2,3,4,5]
list_num_3=[1,2,3,4,5]
list_num_4=[1,2,3,4,5]
list_num_5=[1,2,3,4,5]
list_obj=[*list_num_1,*list_num_2,*list_num_3,*list_num_4,*list_num_5]
print(list_obj)